arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom4809.h
/*
--------------------------------------------------------------------------
CPU - CPU
--------------------------------------------------------------------------
*/

/* CCP signature select */
typedef enum CCP_enum
{
    CCP_SPM_gc = (0x9D<<0),  /* SPM Instruction Protection */
    CCP_IOREG_gc = (0xD8<<0),  /* IO Register Protection */
} CCP_t;

/*
--------------------------------------------------------------------------
CPUINT - Interrupt Controller
--------------------------------------------------------------------------
*/

/* Interrupt Controller */
typedef struct CPUINT_struct
{
    register8_t CTRLA;  /* Control A */
    register8_t STATUS;  /* Status */
    register8_t LVL0PRI;  /* Interrupt Level 0 Priority */
    register8_t LVL1VEC;  /* Interrupt Level 1 Priority Vector */
} CPUINT_t;


/*
--------------------------------------------------------------------------
CRCSCAN - CRCSCAN
--------------------------------------------------------------------------
*/

/* CRCSCAN */
typedef struct CRCSCAN_struct
{
    register8_t CTRLA;  /* Control A */
    register8_t CTRLB;  /* Control B */
    register8_t STATUS;  /* Status */
    register8_t reserved_1[1];
} CRCSCAN_t;

/* CRC Source select */
typedef enum CRCSCAN_SRC_enum
{
    CRCSCAN_SRC_FLASH_gc = (0x00<<0),  /* CRC on entire flash */
    CRCSCAN_SRC_APPLICATION_gc = (0x01<<0),  /* CRC on boot and appl section of flash */
    CRCSCAN_SRC_BOOT_gc = (0x02<<0),  /* CRC on boot section of flash */
} CRCSCAN_SRC_t;

/*
--------------------------------------------------------------------------
EVSYS - Event System
--------------------------------------------------------------------------
*/

/* Event System */
typedef struct EVSYS_struct
{
    register8_t STROBE;  /* Channel Strobe */
    register8_t reserved_1[15];
    register8_t CHANNEL0;  /* Multiplexer Channel 0 */
    register8_t CHANNEL1;  /* Multiplexer Channel 1 */
    register8_t CHANNEL2;  /* Multiplexer Channel 2 */
    register8_t CHANNEL3;  /* Multiplexer Channel 3 */
    register8_t CHANNEL4;  /* Multiplexer Channel 4 */
    register8_t CHANNEL5;  /* Multiplexer Channel 5 */
    register8_t CHANNEL6;  /* Multiplexer Channel 6 */
    register8_t CHANNEL7;  /* Multiplexer Channel 7 */
    register8_t reserved_2[8];
    register8_t USERCCLLUT0A;  /* User CCL LUT0 Event A */
    register8_t USERCCLLUT0B;  /* User CCL LUT0 Event B */
    register8_t USERCCLLUT1A;  /* User CCL LUT1 Event A */
    register8_t USERCCLLUT1B;  /* User CCL LUT1 Event B */
    register8_t USERCCLLUT2A;  /* User CCL LUT2 Event A */
    register8_t USERCCLLUT2B;  /* User CCL LUT2 Event B */
    register8_t USERCCLLUT3A;  /* User CCL LUT3 Event A */
    register8_t USERCCLLUT3B;  /* User CCL LUT3 Event B */
    register8_t USERADC0;  /* User ADC0 */
    register8_t USEREVOUTA;  /* User EVOUT Port A */
    register8_t USEREVOUTB;  /* User EVOUT Port B */
    register8_t USEREVOUTC;  /* User EVOUT Port C */
    register8_t USEREVOUTD;  /* User EVOUT Port D */
    register8_t USEREVOUTE;  /* User EVOUT Port E */
    register8_t USEREVOUTF;  /* User EVOUT Port F */
    register8_t USERUSART0;  /* User USART0 */
    register8_t USERUSART1;  /* User USART1 */
    register8_t USERUSART2;  /* User USART2 */
    register8_t USERUSART3;  /* User USART3 */
    register8_t USERTCA0;  /* User TCA0 */
    register8_t USERTCB0;  /* User TCB0 */
    register8_t USERTCB1;  /* User TCB1 */
    register8_t USERTCB2;  /* User TCB2 */
    register8_t USERTCB3;  /* User TCB3 */
    register8_t reserved_3[8];
} EVSYS_t;

/* Channel selector select */
typedef enum EVSYS_CHANNEL_enum
{
    EVSYS_CHANNEL_OFF_gc = (0x00<<0),  /* Off */
    EVSYS_CHANNEL_CHANNEL0_gc = (0x01<<0),  /* Connect user to event channel 0 */
    EVSYS_CHANNEL_CHANNEL1_gc = (0x02<<0),  /* Connect user to event channel 1 */
    EVSYS_CHANNEL_CHANNEL2_gc = (0x03<<0),  /* Connect user to event channel 2 */
    EVSYS_CHANNEL_CHANNEL3_gc = (0x04<<0),  /* Connect user to event channel 3 */
    EVSYS_CHANNEL_CHANNEL4_gc = (0x05<<0),  /* Connect user to event channel 4 */
    EVSYS_CHANNEL_CHANNEL5_gc = (0x06<<0),  /* Connect user to event channel 5 */
    EVSYS_CHANNEL_CHANNEL6_gc = (0x07<<0),  /* Connect user to event channel 6 */
    EVSYS_CHANNEL_CHANNEL7_gc = (0x08<<0),  /* Connect user to event channel 7 */
} EVSYS_CHANNEL_t;

/* Generator selector select */
typedef enum EVSYS_GENERATOR_enum
{
    EVSYS_GENERATOR_OFF_gc = (0x00<<0),  /* Off */
    EVSYS_GENERATOR_UPDI_gc = (0x01<<0),  /* Unified Program and Debug Interface */
    EVSYS_GENERATOR_RTC_OVF_gc = (0x06<<0),  /* Real Time Counter overflow */
    EVSYS_GENERATOR_RTC_CMP_gc = (0x07<<0),  /* Real Time Counter compare */
    EVSYS_GENERATOR_RTC_PIT0_gc = (0x08<<0),  /* Periodic Interrupt Timer output 0 */
    EVSYS_GENERATOR_RTC_PIT1_gc = (0x09<<0),  /* Periodic Interrupt Timer output 1 */
    EVSYS_GENERATOR_RTC_PIT2_gc = (0x0A<<0),  /* Periodic Interrupt Timer output 2 */
    EVSYS_GENERATOR_RTC_PIT3_gc = (0x0B<<0),  /* Periodic Interrupt Timer output 3 */
    EVSYS_GENERATOR_CCL_LUT0_gc = (0x10<<0),  /* Configurable Custom Logic LUT0 */
    EVSYS_GENERATOR_CCL_LUT1_gc = (0x11<<0),  /* Configurable Custom Logic LUT1 */
    EVSYS_GENERATOR_CCL_LUT2_gc = (0x12<<0),  /* Configurable Custom Logic LUT2 */
    EVSYS_GENERATOR_CCL_LUT3_gc = (0x13<<0),  /* Configurable Custom Logic LUT3 */
    EVSYS_GENERATOR_AC0_OUT_gc = (0x20<<0),  /* Analog Comparator 0 out */
    EVSYS_GENERATOR_ADC0_RESRDY_gc = (0x24<<0),  /* ADC 0 Result Ready Event */
    EVSYS_GENERATOR_PORT0_PIN0_gc = (0x40<<0),  /* Port 0 Pin 0 */
    EVSYS_GENERATOR_PORT0_PIN1_gc = (0x41<<0),  /* Port 0 Pin 1 */
    EVSYS_GENERATOR_PORT0_PIN2_gc = (0x42<<0),  /* Port 0 Pin 2 */
    EVSYS_GENERATOR_PORT0_PIN3_gc = (0x43<<0),  /* Port 0 Pin 3 */
    EVSYS_GENERATOR_PORT0_PIN4_gc = (0x44<<0),  /* Port 0 Pin 4 */
    EVSYS_GENERATOR_PORT0_PIN5_gc = (0x45<<0),  /* Port 0 Pin 5 */
    EVSYS_GENERATOR_PORT0_PIN6_gc = (0x46<<0),  /* Port 0 Pin 6 */
    EVSYS_GENERATOR_PORT0_PIN7_gc = (0x47<<0),  /* Port 0 Pin 7 */
    EVSYS_GENERATOR_PORT1_PIN0_gc = (0x48<<0),  /* Port 1 Pin 0 */
    EVSYS_GENERATOR_PORT1_PIN1_gc = (0x49<<0),  /* Port 1 Pin 1 */
    EVSYS_GENERATOR_PORT1_PIN2_gc = (0x4A<<0),  /* Port 1 Pin 2 */
    EVSYS_GENERATOR_PORT1_PIN3_gc = (0x4B<<0),  /* Port 1 Pin 3 */
    EVSYS_GENERATOR_PORT1_PIN4_gc = (0x4C<<0),  /* Port 1 Pin 4 */
    EVSYS_GENERATOR_PORT1_PIN5_gc = (0x4D<<0),  /* Port 1 Pin 5 */
    EVSYS_GENERATOR_PORT1_PIN6_gc = (0x4E<<0),  /* Port 1 Pin 6 */
    EVSYS_GENERATOR_PORT1_PIN7_gc = (0x4F<<0),  /* Port 1 Pin 7 */
    EVSYS_GENERATOR_USART0_XCK_gc = (0x60<<0),  /* USART 0 Xclock */
    EVSYS_GENERATOR_USART1_XCK_gc = (0x61<<0),  /* USART 1 Xclock */
    EVSYS_GENERATOR_USART2_XCK_gc = (0x62<<0),  /* USART 2 Xclock */
    EVSYS_GENERATOR_USART3_XCK_gc = (0x63<<0),  /* USART 3 Xclock */
    EVSYS_GENERATOR_SPI0_SCK_gc = (0x68<<0),  /* SPI 0 Sclock */
    EVSYS_GENERATOR_TCA0_OVF_LUNF_gc = (0x80<<0),  /* Timer/Counter A0 overflow / low byte underflow */
    EVSYS_GENERATOR_TCA0_HUNF_gc = (0x81<<0),  /* Timer/Counter A0 high byte underflow (split mode) */
    EVSYS_GENERATOR_TCA0_CMP0_gc = (0x84<<0),  /* Timer/Counter A0 compare 0 */
    EVSYS_GENERATOR_TCA0_CMP1_gc = (0x85<<0),  /* Timer/Counter A0 compare 1 */
    EVSYS_GENERATOR_TCA0_CMP2_gc = (0x86<<0),  /* Timer/Counter A0 compare 2 */
    EVSYS_GENERATOR_TCB0_CAPT_gc = (0xA0<<0),  /* Timer/Counter B0 capture */
    EVSYS_GENERATOR_TCB1_CAPT_gc = (0xA2<<0),  /* Timer/Counter B1 capture */
    EVSYS_GENERATOR_TCB2_CAPT_gc = (0xA4<<0),  /* Timer/Counter B2 capture */
    EVSYS_GENERATOR_TCB3_CAPT_gc = (0xA6<<0),  /* Timer/Counter B3 capture */
} EVSYS_GENERATOR_t;

/* Software event on channels select */
typedef enum EVSYS_STROBE0_enum
{
    EVSYS_STROBE0_EV_STROBE_CH0_gc = (0x01<<0),  /*  */
    EVSYS_STROBE0_EV_STROBE_CH1_gc = (0x02<<0),  /*  */
    EVSYS_STROBE0_EV_STROBE_CH2_gc = (0x04<<0),  /*  */
    EVSYS_STROBE0_EV_STROBE_CH3_gc = (0x08<<0),  /*  */
    EVSYS_STROBE0_EV_STROBE_CH4_gc = (0x10<<0),  /*  */
    EVSYS_STROBE0_EV_STROBE_CH5_gc = (0x20<<0),  /*  */
    EVSYS_STROBE0_EV_STROBE_CH6_gc = (0x40<<0),  /*  */
    EVSYS_STROBE0_EV_STROBE_CH7_gc = (0x80<<0),  /*  */
} EVSYS_STROBE0_t;

